{   
    "base_dir":"/root/autodl-tmp/LLaVA/experiment_imgs",
    "w": [0, 0.2, 0.4, 0.6, 0.8, 1],
    "carry":{
        "ARB_dir":"carry/an astronaut carries a horse",
        "BRA_dir":"carry/a horse carries an astronaut",
        "sum_sentence":"Please describe the relation between the astronaut and the horse in concise language for me.",
        "question":"Is there a astronaut leading a horse or a astronaut riding a horse? Please choose the more probable one and answer with one sentence.",
        "question_pre":"Are there both an astronaut and a horse in the image? Please answer with yes or no.",
        "questionA":"Is there any astronaut in the image? Please answer with yes or no.",
        "questionB":"Is there any horse in the image? Please answer with yes or no.",
        "A_key_words": ["astronaut", "man", "woman"],
        "B_key_words": ["horse"],
        "R_key_words":["leads","leading", "next", "beside"],
        "R_inver_key_words":["ride", "rides", "riding"]
    },
    "chase":{
        "ARB_dir":"chase/there is a cat chasing a dog",
        "BRA_dir":"chase/there is a dog chasing a cat",
        "sum_sentence":"Please describe the relation between the cat and the dog in concise language for me.",
        "question":"Is there a cat chasing a dog or a dog chasing a cat? Please choose the more probable one and answer with one sentence.",
        "question_pre":"Are there both a cat and a dog in the image? Please answer with yes or no.",
        "questionA":"Is there any cat in the image? Please answer with yes or no",
        "questionB":"Is there any dog in the image? Please answer with yes or no",
        "A_key_words": ["cat"],
        "B_key_words": ["dog"],
        "R_key_words":["chasing","chases"],
        "R_inver_key_words":[]
    },
    "circle":{
        "ARB_dir":"circle/flowers circle a rock",
        "BRA_dir":"circle/rocks circle a flower",
        "sum_sentence":"Please describe the relation between the flower and the rock in concise language for me.",
        "question":"Is there a rock among flowers or a flower among rocks? Please choose the more probable one and answer with one sentence.",
        "question_pre":"Are there both flower and rock in the image? Please answer with yes or no.",
        "questionA":"Is there any flower in the image? Please answer with yes or no.",
        "questionB":"Is there any rock in the image? Please answer with yes or no.",
        "A_key_words": ["flower", "flowers"],
        "B_key_words": ["rock", "rocks"],
        "R_key_words":["circles"],
        "R_inver_key_words":["among", "surrounded", "on"]
    },
    "contain":{
        "ARB_dir":"contain/a car contains bottle",
        "BRA_dir":"contain/a bottle contains car",
        "sum_sentence":"Please describe the relation between the car and the bottle in concise language for me.",
        "question":"Is there a car inside the bottle or a bottle inside the car? Please choose the more probable one and answer with one sentence.",
        "question_pre":"Is there both a car and a bottle in the image? Please answer with yes or no.",
        "questionA":"Is there any car in the image? Please answer with yes or no.",
        "questionB":"Is there any bottle in the image? Please answer with yes or no.",
        "A_key_words": ["car"],
        "B_key_words": ["bottle"],
        "R_key_words":["contains"],
        "R_inver_key_words":["inside", "in"]
    },
    "follow":{
        "ARB_dir":"follow/a person is following a dog",
        "BRA_dir":"follow/a dog is following a person",
        "sum_sentence":"Please describe the relation between the person and the dog in concise language for me.",
        "question":"Is there a person following a dog or a dog following a person? Please choose the more probable one and answer with one sentence.",
        "question_pre":"Is there both a dog and a person in the image? Please answer with yes or no.",
        "questionA":"Is there any person in the image? Please answer with yes or no",
        "questionB":"Is there any dog in the image? Please answer with yes or no",
        "A_key_words": ["person", "man", "woman"],
        "B_key_words": ["dog"],
        "R_key_words":["following","follows","walking"],
        "R_inver_key_words":[]
    },
    "lick":{
        "ARB_dir":"lick/cat licks dog",
        "BRA_dir":"lick/dog licks cat",
        "sum_sentence":"Please describe the relation between the dog and the cat in concise language for me.",
        "question":"Is there a cat licking a dog or a dog licking a cat? Please choose the more probable one and answer with one sentence.",
        "question_pre":"Is there both a dog and a cat in the image? Please answer with yes or no.",
        "questionA":"Is there any cat in the image? Please answer with yes or no.",
        "questionB":"Is there any dog in the image? Please answer with yes or no.",
        "A_key_words": ["cat"],
        "B_key_words": ["dog"],
        "R_key_words":["licks", "licking"],
        "R_inver_key_words":[]
    },
    "paint":{
        "ARB_dir":"paint/a painting of house is painted on a rock",
        "BRA_dir":"paint/a painting of rock is painted on a house",
        "sum_sentence":"Please describe the relation between the house and the rock in concise language for me.",
        "question":"Is there a painting of rock painted on the wall of house or a painting of house painted on a rock? Please choose the more probable one and answer with one sentence.",
        "question_pre":"Is there both a house and a rock in the image? Please answer with yes or no.",
        "questionA":"Is there any house in the image? Please answer with yes or no.",
        "questionB":"Is there any rock in the image? Please answer with yes or no.",
        "A_key_words": ["house"],
        "B_key_words": ["rock", "rocks"],
        "R_key_words":["painted", "on"],
        "R_inver_key_words":["made"]
    },
    "place":{
        "ARB_dir":"place/a book is placed on a bowl",
        "BRA_dir":"place/a bowl is placed on the book",
        "sum_sentence":"Please describe the relation between the book and the bowl in concise language for me.",
        "question":"Is there a book placed on a bowl or a bowl placed on a book? Please choose the more probable one and answer with one sentence.",
        "question_pre":"Is there both a book and a bowl in the image? Please answer with yes or no.",
        "questionA":"Is there any book in the image? Please answer with yes or no.",
        "questionB":"Is there any bowl in the image? Please answer with yes or no.",
        "A_key_words": ["book", "books"],
        "B_key_words": ["bowl", "bowls"],
        "R_key_words":["on", "placed"],
        "R_inver_key_words":["under", "below"]
    },
    "point at":{
        "ARB_dir":"point at/man points at woman",
        "BRA_dir":"point at/woman points at man",
        "sum_sentence":"Please describe the relation between the man and the woman in concise language for me.",
        "question":"Is there a man pointing at a woman or a woman pointing at a man? Please choose the more probable one and answer with one sentence.",
        "question_pre":"Is there both woman and man in the image? Please answer with yes or no.",
        "questionA":"Is there any man in the image? Please answer with yes or no.",
        "questionB":"Is there any woman in the image? Please answer with yes or no.",
        "A_key_words": ["man"],
        "B_key_words": ["woman"],
        "R_key_words":["points", "pointing"],
        "R_inver_key_words":[]
    },
    "shade":{
        "ARB_dir":"shade/tiger shaded tree",
        "BRA_dir":"shade/tree shaded tiger",
        "sum_sentence":"Please describe the relation between the tiger and the tree in concise language for me.",
        "question":"Is there a tiger behind the tree or a tiger in front of the tree? Please choose the more probable one and answer with one sentence.",
        "question_pre":"Is there both tiger and tree in the image? Please answer with yes or no.",
        "questionA":"Is there any tiger in the image? Please answer with yes or no.",
        "questionB":"Is there any tree in the image? Please answer with yes or no.",
        "A_key_words": ["tiger"],
        "B_key_words": ["tree", "trees"],
        "R_key_words":["front"],
        "R_inver_key_words":["behind"]
    },
    "touch":{
        "ARB_dir":"touch/a cat touches a boy",
        "BRA_dir":"touch/a boy touches a cat",
        "sum_sentence":"Please describe the relation between the cat and the boy in concise language for me.",
        "question":"Is there a cat touching a boy or a boy touching a cat? Please choose the more probable one and answer with one sentence.",
        "question_pre":"Is there both a cat and a boy in the image? Please answer with yes or no.",
        "questionA":"Is there any cat in the image? Please answer with yes or no.",
        "questionB":"Is there any boy in the image? Please answer with yes or no.",
        "A_key_words": ["cat"],
        "B_key_words": ["boy"],
        "R_key_words":["touches", "touching", "petting"],
        "R_inver_key_words":[]
    }



}